{
  "Acaciella": { "image": "/plantImgs/acaciella.jpg", "description": "The only Acaciella on the list-- Acaciella- angustissima (prairie acacia, white-ball acacia, ocpatl, or palo de pulque)[4] is most recognized for its drought tolerance and its ability to be used as a green manure and ground covering. It is a perennial, deciduous, and belongs to the family Fabaceae (beans/legumes) and as it grows it starts as a shrub but eventually matures to a small tree. The tree has a high density of leaves along with small clumps of white flowers and creates 4–7 cm long seed pods." },
  "Achillea": { "image": "/plantImgs/achillea.jpg", "description": "Achillea /ækɪˈliːə/[4] is a genus of flowering plants in the family Asteraceae. The plants typically have frilly leaves and are known colloquially as yarrows, although this common name usually refers to A. millefolium. The genus was named after the Greek mythological character Achilles, whose soldiers were said to have used yarrow to treat their wounds;[5] this is reflected by common names such as allheal and bloodwort. The genus is native primarily to Eurasia and North America." },
  "Agalinis": { "image": "/plantImgs/agalinis.jpg", "description": "Agalinis (false foxglove) is a genus of about 70 species in North, Central, and South America that until recently was aligned with members of the family Scrophulariaceae.[2] As a result of numerous molecular phylogenetic studies based on various chloroplast DNA (cpDNA) loci, it was shown to be more closely related to members of the Orobanchaceae. Agalinis species are hemiparasitic, which is a character that in part describes the Orobanchaceae." },
  "Agastache": { "image": "/plantImgs/agastache.jpg", "description": "Agastache (/ˌæɡəˈstɑːkiː/) is a genus of aromatic flowering herbaceous perennial plants in the family Lamiaceae. It contains 22 species, mainly native to North America, one species native to eastern Asia. The common names of the species are a variety of fairly ambiguous and confusing \"hyssops\" and \"mints\"; as a whole the genus is known as giant hyssops or hummingbird mints.[1][2][3][4]" },
  "Andropogon": { "image": "/plantImgs/andropogon.jpg", "description": "Andropogon (common names: beard grass, bluestem grass, broomsedge) is a widespread genus of plants in the grass family, native to much of Asia, Africa, and the Americas, as well as Southern Europe and various oceanic islands.[4][5][6][7][8]\n\nOver 100 species have been described.[3][4][9]" },
  "Anemone": { "image": "/plantImgs/anemone.jpg", "description": "Anemone (/əˈnɛməniː/) is a genus of flowering plants in the buttercup family Ranunculaceae. Plants of the genus are commonly called windflowers.[2] They are native to the temperate and subtropical regions of all regions except Australia, New Zealand, and Antarctica.[1] The genus is closely related to several other genera including Anemonoides, Anemonastrum, Hepatica, and Pulsatilla. Some botanists include these genera within Anemone.[3][4]" },
  "Argemone": { "image": "/plantImgs/argemone.jpg", "description": "Argemone is a genus of flowering plants in the family Papaveraceae commonly known as prickly poppies.[2] There are about 32 species native to the Americas and Hawaii.[3] The generic name originated as ἀργεμώνη in Greek and was applied by Dioscorides to a poppy-like plant used to treat cataracts.[4][5]" },
  "Aristida": { "image": "/plantImgs/aristida.jpg", "description": "Aristida is a very nearly cosmopolitan genus of plants in the grass family.[4][5] Aristida is distinguished by having three awns (bristles) on each lemma of each floret.[6] The genus includes about 300 species found worldwide, often in arid warm regions. This genus is among those colloquially called three-awns wiregrasses, speargrasses and needlegrasses.[7][8][9] The name Aristida is derived from the Latin \"arista\", meaning \"awn\".[10]\n\nThey are characteristic of semiarid grassland. The Wiregrass Region of North America is named for A. stricta. Other locales where this genus is an important component of the ecosystem include the Carolina Bays, the sandhills of the Carolinas, and elsewhere, Mulga scrub in Australia, and the xeric grasslands around Lake Turkana in Africa. Local increases in the abundance of wiregrasses is a good indicator of overgrazing, as livestock avoid them." },
  "Artemisia": { "image": "/plantImgs/artemisia.jpg", "description": "Artemisia (/ˌɑːrtɪˈmiːziə/)[3] is a large, diverse genus of plants belonging to the daisy family, Asteraceae, with almost 500 species. Common names for various species in the genus include mugwort, wormwood, and sagebrush. Artemisia comprises hardy herbaceous plants and shrubs, which are known for the powerful chemical constituents in their essential oils. Artemisia species grow in temperate climates of both hemispheres, usually in dry or semiarid habitats. Notable species include A. vulgaris (common mugwort), A. tridentata (big sagebrush), A. annua (sagewort), A. absinthium (wormwood), A. dracunculus (tarragon), and A. abrotanum (southernwood), and A. herba-alba (white wormwood). The leaves of many species are covered with white hairs.\n\nMost species have strong aromas and bitter tastes from terpenoids and sesquiterpene lactones, which discourage herbivory, and may have had a selective advantage.[5] The small flowers are wind-pollinated.[5] Artemisia species are used as food plants by the larvae of a number of Lepidoptera species." },
  "Asclepias": { "image": "/plantImgs/asclepias.jpg", "description": "Asclepias is a genus of herbaceous, perennial, flowering plants known as milkweeds, named for their latex, a milky substance containing cardiac glycosides termed cardenolides, exuded where cells are damaged.[4][5][6] Most species are toxic to humans and many other species, primarily due to the presence of cardenolides. However, as with many such plants, some species feed upon milkweed leaves or the nectar from their flowers. A noteworthy feeder on milkweeds is the monarch butterfly, which uses and requires certain milkweeds as host plants for its larvae." },
  "Baptisia": { "image": "/plantImgs/baptisia.jpg", "description": "Baptisia, commonly referred to as wild indigo or false indigo, represents a diverse genus within the legume family, Fabaceae. These flowering herbaceous perennials exhibit an array of characteristics, including pea-like flowers, blooming in the spring that eventually mature into pods, occasionally displaying an inflated form. Renowned for their enduring presence and a spectrum of colours ranging from yellow, blue and white,[2] Baptisia's captivate gardeners with their colourful stems, unique foliage, and exquisite flowers.\n\nNative to regions spanning from the East to the Midwest of North America, Baptisia species contribute to the natural beauty of various ecosystems. Their flowers, adorned with characteristic wing and keel petals, give rise to bean-like fruit. Typically, their leaves are trifoliate, divided into three segments, often accompanied by small stipules on the petiole, which aid in species identification.[3]" },
  "Betula": { "image": "/plantImgs/betula.jpg", "description": "A birch is a thin-leaved deciduous hardwood tree of the genus Betula (/ˈbɛtjʊlə/),[2] in the family Betulaceae, which also includes alders, hazels, and hornbeams. It is closely related to the beech-oak family Fagaceae. The genus Betula contains 30 to 60 known taxa of which 11 are on the IUCN 2011 Red List of Threatened Species. They are typically short-lived pioneer species and are widespread in the Northern Hemisphere, particularly in northern areas of temperate climates and in boreal climates.[3] Birch wood is used for a wide range of purposes" },
  "Blephilia": { "image": "/plantImgs/abronia.jpg", "description": "Blephilia, the pagoda plant or wood mint, is a genus of four species of flowering plants in the family Lamiaceae. They are all herbaceous plants native to eastern North America.[1][2] Blephilia are most often found in open areas, glades, and mesic forests. All species of Blephilia are considered threatened or endangered in some states. [3] [4][5] [6]\n\nThe genus includes only perennial species that spread by both seeds and through stem division. Small white to purple-lavender flowers occur in inflorescences that cluster in the upper leaf axils, often in several circular layers (hence the common name pagoda-plant). Leaves are generally lanceolate to ovate and vary in shades of green. Leaves are either petiolate or subsessile (depending on the species).[5] Like many other members of the subtribe Menthinae, all parts of Blephilia are highly aromatic when crushed and have smells similar to menthol and spearmint." },
  "Bothriochloa": { "image": "/plantImgs/bothriochloa.jpg", "description": "Bothriochloa is a common and widespread genus of plants in the grass family native to many countries on all inhabited continents and many islands.[4] They are often called beardgrass, bluegrass or bluestem. Some species are invasive in areas where they have been introduced.[5][6]\n\nThe etymology of the genus name Bothriochloa derives from the two ancient Greek words βοθρίον (bothríon), meaning \"small pit or trench\", and χλόη or χλόα (khlóa), meaning \"new green shoot or blade of grass\".[7][8][9" },
  "Bouteloua": { "image": "/plantImgs/bouteloua.jpg", "description": "Bouteloua is a genus of plants in the grass family Poaceae.[4][5] Members of the genus are commonly known as grama grass. The top of a flower spike of Bouteloua hirsuta ([hairy grama), showing the flattened rachis\nBouteloua includes both annual and perennial grasses, which frequently form stolons.[7] Species have an inflorescence of 1 to 80 racemes or spikes positioned alternately on the culm (stem). The rachis (stem) of the spike is flattened. The spikelets are positioned along one side of the spike. Each spikelet contains one fertile floret, and usually one sterile floret." },
  "Bulbostylis": { "image": "/plantImgs/bulbostylis.jpg", "description": "Bulbostylis is a genus of plants in the sedge family. They are sometimes called hairsedges. There are over 200 species of these clump-forming plants of dry grasslands and warm and tropical savannas worldwide. They have solid, rounded, grooved stems and long, thin basal leaves. They bear spikelets of flowers." },
  "Caltha": { "image": "/plantImgs/caltha.jpg", "description": "Caltha is a genus of rhizomatous perennial flowering plants in the family Ranunculaceae (\"buttercup family\"), to which ten species have been assigned. They occur in moist environments in temperate and cold regions of both the Northern and Southern Hemispheres.[3] Their leaves are generally heart-shaped or kidney-shaped, or are characteristically diplophyllous (the auricles of the leaf blades form distinctly inflexed appendages). Flowers are star shaped and mostly yellow to white. True petals and nectaries are missing but the five or more sepals are distinctly colored. As usual in the buttercup family there is a circle of stamens around (two to twenty-five) free carpels.[2]" },
  "Callitriche": { "image": "/plantImgs/callitriche.jpg", "description": "Callitriche is a genus of largely aquatic plants known as water-starwort. Previously, it was the only genus in the family Callitrichaceae. However, according to the APG II system this family is now included in the Plantaginaceae (plantain family). The family name Callitrichaceae retains its status as nomen conservandum (name to be retained)." },
  "Camassia": { "image": "/plantImgs/camassia.jpg", "description": "" },
  "Carex": { "image": "/plantImgs/carex.jpg", "description": "" },
  "Carya": { "image": "/plantImgs/carya.jpg", "description": "" },
  "Castilleja": { "image": "/plantImgs/castilleja.jpg", "description": "" },
  "Cephalanthus": { "image": "/plantImgs/cephalanthus.jpg", "description": "" },
  "Chaetopappa": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Chrysopsis": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Cichorium": { "image": "/plantImgs/cichorium.jpg", "description": "" },
  "Clematis": { "image": "/plantImgs/clematis.jpg", "description": "" },
  "Cleome": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Conoclinium": { "image": "/plantImgs/conoclinium.jpg", "description": "" },
  "Cornus": { "image": "/plantImgs/cornus.jpg", "description": "" },
  "Coreopsis": { "image": "/plantImgs/coreopsis.jpg", "description": "" },
  "Cynanchum": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Cyperus": { "image": "/plantImgs/cyperus.jpg", "description": "" },
  "Cyclachaena": { "image": "/plantImgs/cyclachaena.jpg", "description": "" },
  "Dalea": { "image": "/plantImgs/dalea.jpg", "description": "" },
  "Dracopis": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Dysphania": { "image": "/plantImgs/dysphania.jpg", "description": "" },
  "Dyssodia": { "image": "/plantImgs/dyssodia.jpg", "description": "" },
  "Echinacea": { "image": "/plantImgs/echinacea.jpg", "description": "" },
  "Eleocharis": { "image": "/plantImgs/eleocharis.jpg", "description": "" },
  "Erigeron": { "image": "/plantImgs/erigeron.jpg", "description": "" },
  "Eriochloa": { "image": "/plantImgs/eriochloa.jpg", "description": "" },
  "Eryngium": { "image": "/plantImgs/eryngium.jpg", "description": "" },
  "Eurybia": { "image": "/plantImgs/eurybia.jpg", "description": "" },
  "Eustoma": { "image": "/plantImgs/eustoma.jpg", "description": "" },
  "Forestiera": { "image": "/plantImgs/forestiera.jpg", "description": "" },
  "Fuirena": { "image": "/plantImgs/fuirena.jpg", "description": "" },
  "Gaillardia": { "image": "/plantImgs/gaillardia.jpg", "description": "" },
  "Gymnocarpium": { "image": "/plantImgs/gymnocarpium.jpg", "description": "" },
  "Heuchera": { "image": "/plantImgs/heuchera.jpg", "description": "" },
  "Helianthus": { "image": "/plantImgs/helianthus.jpg", "description": "" },
  "Helenium": { "image": "/plantImgs/helenium.jpg", "description": "" },
  "Hibiscus": { "image": "/plantImgs/hibiscus.jpg", "description": "" },
  "Hydrocotyle": { "image": "/plantImgs/hydrocotyle.jpg", "description": "" },
  "Ionactis": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Iris": { "image": "/plantImgs/iris.jpg", "description": "" },
  "Iva": { "image": "/plantImgs/iva.jpg", "description": "" },
  "Juncus": { "image": "/plantImgs/juncus.jpg", "description": "" },
  "Juniperus": { "image": "/plantImgs/juniperus.jpg", "description": "" },
  "Koeleria": { "image": "/plantImgs/koeleria.jpg", "description": "" },
  "Kyllinga": { "image": "/plantImgs/kyllinga.jpg", "description": "" },
  "Lactuca": { "image": "/plantImgs/lactuca.jpg", "description": "" },
  "Linum": { "image": "/plantImgs/linum.jpg", "description": "" },
  "Lotus": { "image": "/plantImgs/lotus.jpg", "description": "" },
  "Ludwigia": { "image": "/plantImgs/ludwigia.jpg", "description": "" },
  "Luzula": { "image": "/plantImgs/luzula.jpg", "description": "" },
  "Lygodesmia": { "image": "/plantImgs/lygodesmia.jpg", "description": "" },
  "Machaeranthera": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Malus": { "image": "/plantImgs/malus.jpg", "description": "" },
  "Mentha": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Mirabilis": { "image": "/plantImgs/mirabilis.jpg", "description": "" },
  "Monarda": { "image": "/plantImgs/monarda.jpg", "description": "" },
  "Nemastylis": { "image": "/plantImgs/nemastylis.jpg", "description": "" },
  "Nothocalais": { "image": "/plantImgs/nothocalais.jpg", "description": "" },
  "Opuntia": { "image": "/plantImgs/opuntia.jpg", "description": "" },
  "Packera": { "image": "/plantImgs/packera.jpg", "description": "" },
  "Panicum": { "image": "/plantImgs/panicum.jpg", "description": "" },
  "Penstemon": { "image": "/plantImgs/penstemon.jpg", "description": "" },
  "Penthorum": { "image": "/plantImgs/penthorum.jpg", "description": "" },
  "Phlox": { "image": "/plantImgs/phlox.jpg", "description": "" },
  "Phoradendron": { "image": "/plantImgs/phoradendron.jpg", "description": "" },
  "Phemeranthus": { "image": "/plantImgs/phemeranthus.jpg", "description": "" },
  "Physalis": { "image": "/plantImgs/physalis.jpg", "description": "" },
  "Platanthera": { "image": "/plantImgs/platanthera.jpg", "description": "" },
  "Platanus": { "image": "/plantImgs/platanus.jpg", "description": "" },
  "Polytaenia": { "image": "/plantImgs/polytaenia.jpg", "description": "" },
  "Pontederia": { "image": "/plantImgs/pontederia.jpg", "description": "" },
  "Quercus": { "image": "/plantImgs/quercus.jpg", "description": "" },
  "Ranunculus": { "image": "/plantImgs/ranunculus.jpg", "description": "" },
  "Ratibida": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Rayjacksonia": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Rhynchospora": { "image": "/plantImgs/rhynchospora.jpg", "description": "" },
  "Rosa": { "image": "/plantImgs/rosa.jpg", "description": "" },
  "Rudbeckia": { "image": "/plantImgs/rudbeckia.jpg", "description": "" },
  "Rumex": { "image": "/plantImgs/rumex.jpg", "description": "" },
  "Salix": { "image": "/plantImgs/salix.jpg", "description": "" },
  "Salvia": { "image": "/plantImgs/salvia.jpg", "description": "" },
  "Schizachyrium": { "image": "/plantImgs/schizachyrium.jpg", "description": "" },
  "Scleria": { "image": "/plantImgs/scleria.jpg", "description": "" },
  "Scutellaria": { "image": "/plantImgs/scutellaria.jpg", "description": "" },
  "Sedum": { "image": "/plantImgs/sedum.jpg", "description": "" },
  "Senecio": { "image": "/plantImgs/senecio.jpg", "description": "" },
  "Sida": { "image": "/plantImgs/sida.jpg", "description": "" },
  "Solidago": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Sonchus": { "image": "/plantImgs/sonchus.jpg", "description": "" },
  "Spartina": { "image": "/plantImgs/spartina.jpg", "description": "" },
  "Sphenopholis": { "image": "/plantImgs/sphenopholis.jpg", "description": "" },
  "Sporobolus": { "image": "/plantImgs/sporobolus.jpg", "description": "" },
  "Symphyotrichum": { "image": "/plantImgs/abronia.jpg", "description": "" },
  "Syringa": { "image": "/plantImgs/syringa.jpg", "description": "" },
  "Thelypteris": { "image": "/plantImgs/thelypteris.jpg", "description": "" },
  "Tilia": { "image": "/plantImgs/tilia.jpg", "description": "" },
  "Toxicodendron": { "image": "/plantImgs/toxicodendron.jpg", "description": "" },
  "Tradescantia": { "image": "/plantImgs/tradescantia.jpg", "description": "" },
  "Trifolium": { "image": "/plantImgs/trifolium.jpg", "description": "" },
  "Triodanis": { "image": "/plantImgs/triodanis.jpg", "description": "" },
  "Typha": { "image": "/plantImgs/typha.jpg", "description": "" },
  "Ulmus": { "image": "/plantImgs/ulmus.jpg", "description": "" },
  "Verbena": { "image": "/plantImgs/verbena.jpg", "description": "" },
  "Vernonia": { "image": "/plantImgs/vernonia.jpg", "description": "" },
  "Viola": { "image": "/plantImgs/viola.jpg", "description": "" },
  "Zanthoxylum": { "image": "/plantImgs/zanthoxylum.jpg", "description": "" }
}