{
  "Acaciella": {
    "image": "/plantImgs/acaciella.jpg",
    "description": "Photo by: By Eric Hunt - Own work, CC BY-SA 4.0, https://commons.wikimedia.org/w/index.php?curid=93177568 || The only Acaciella on the list-- Acaciella- angustissima (prairie acacia, white-ball acacia, ocpatl, or palo de pulque)[4] is most recognized for its drought tolerance and its ability to be used as a green manure and ground covering. It is a perennial, deciduous, and belongs to the family Fabaceae (beans/legumes) and as it grows it starts as a shrub but eventually matures to a small tree. The tree has a high density of leaves along with small clumps of white flowers and creates 4–7 cm long seed pods."
  },
  "Achillea": {
    "image": "/plantImgs/achillea.jpg",
    "description": "Achillea /ækɪˈliːə/[4] is a genus of flowering plants in the family Asteraceae. The plants typically have frilly leaves and are known colloquially as yarrows, although this common name usually refers to A. millefolium. The genus was named after the Greek mythological character Achilles, whose soldiers were said to have used yarrow to treat their wounds;[5] this is reflected by common names such as allheal and bloodwort. The genus is native primarily to Eurasia and North America."
  },
  "Agalinis": {
    "image": "/plantImgs/agalinis.jpg",
    "description": "Agalinis (false foxglove) is a genus of about 70 species in North, Central, and South America that until recently was aligned with members of the family Scrophulariaceae.[2] As a result of numerous molecular phylogenetic studies based on various chloroplast DNA (cpDNA) loci, it was shown to be more closely related to members of the Orobanchaceae. Agalinis species are hemiparasitic, which is a character that in part describes the Orobanchaceae."
  },
  "Agastache": {
    "image": "/plantImgs/agastache.jpg",
    "description": "Agastache (/ˌæɡəˈstɑːkiː/) is a genus of aromatic flowering herbaceous perennial plants in the family Lamiaceae. It contains 22 species, mainly native to North America, one species native to eastern Asia. The common names of the species are a variety of fairly ambiguous and confusing \"hyssops\" and \"mints\"; as a whole the genus is known as giant hyssops or hummingbird mints.[1][2][3][4]"
  },
  "Andropogon": {
    "image": "/plantImgs/andropogon.jpg",
    "description": "Andropogon (common names: beard grass, bluestem grass, broomsedge) is a widespread genus of plants in the grass family, native to much of Asia, Africa, and the Americas, as well as Southern Europe and various oceanic islands.[4][5][6][7][8]\n\nOver 100 species have been described.[3][4][9]"
  },
  "Anemone": {
    "image": "/plantImgs/anemone.jpg",
    "description": "Anemone (/əˈnɛməniː/) is a genus of flowering plants in the buttercup family Ranunculaceae. Plants of the genus are commonly called windflowers.[2] They are native to the temperate and subtropical regions of all regions except Australia, New Zealand, and Antarctica.[1] The genus is closely related to several other genera including Anemonoides, Anemonastrum, Hepatica, and Pulsatilla. Some botanists include these genera within Anemone.[3][4]"
  },
  "Argemone": {
    "image": "/plantImgs/argemone.jpg",
    "description": "Argemone is a genus of flowering plants in the family Papaveraceae commonly known as prickly poppies.[2] There are about 32 species native to the Americas and Hawaii.[3] The generic name originated as ἀργεμώνη in Greek and was applied by Dioscorides to a poppy-like plant used to treat cataracts.[4][5]"
  },
  "Aristida": {
    "image": "/plantImgs/aristida.jpg",
    "description": "Aristida is a very nearly cosmopolitan genus of plants in the grass family.[4][5] Aristida is distinguished by having three awns (bristles) on each lemma of each floret.[6] The genus includes about 300 species found worldwide, often in arid warm regions. This genus is among those colloquially called three-awns wiregrasses, speargrasses and needlegrasses.[7][8][9] The name Aristida is derived from the Latin \"arista\", meaning \"awn\".[10]\n\nThey are characteristic of semiarid grassland. The Wiregrass Region of North America is named for A. stricta. Other locales where this genus is an important component of the ecosystem include the Carolina Bays, the sandhills of the Carolinas, and elsewhere, Mulga scrub in Australia, and the xeric grasslands around Lake Turkana in Africa. Local increases in the abundance of wiregrasses is a good indicator of overgrazing, as livestock avoid them."
  },
  "Artemisia": {
    "image": "/plantImgs/artemisia.jpg",
    "description": "Artemisia (/ˌɑːrtɪˈmiːziə/)[3] is a large, diverse genus of plants belonging to the daisy family, Asteraceae, with almost 500 species. Common names for various species in the genus include mugwort, wormwood, and sagebrush. Artemisia comprises hardy herbaceous plants and shrubs, which are known for the powerful chemical constituents in their essential oils. Artemisia species grow in temperate climates of both hemispheres, usually in dry or semiarid habitats. Notable species include A. vulgaris (common mugwort), A. tridentata (big sagebrush), A. annua (sagewort), A. absinthium (wormwood), A. dracunculus (tarragon), and A. abrotanum (southernwood), and A. herba-alba (white wormwood). The leaves of many species are covered with white hairs.\n\nMost species have strong aromas and bitter tastes from terpenoids and sesquiterpene lactones, which discourage herbivory, and may have had a selective advantage.[5] The small flowers are wind-pollinated.[5] Artemisia species are used as food plants by the larvae of a number of Lepidoptera species."
  },
  "Asclepias": {
    "image": "/plantImgs/asclepias.jpg",
    "url":"https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=g410",
    "description": "Asclepias incarnata, commonly called swamp milkweed, is an erect, clump-forming, Missouri native plant which is commonly found in swamps, river bottomlands and wet meadows throughout the State. It typically grows 3-4' tall (less frequently to 5') on branching stems. Small, fragrant, pink to mauve flowers (1/4\" wide), each with five reflexed petals and an elevated central crown, appear in tight clusters (umbels) at the stem ends in summer. Flowers are uncommonly white. Narrow, lance-shaped, taper-pointed leaves are 3-6\" long. Stems exude a toxic milky sap when cut. Flowers are followed by attractive seed pods (to 4\" long) which split open when ripe releasing silky-haired seeds easily carried by the wind. Flowers are very attractive to butterflies and hummingbirds as a nectar source. In addition, swamp milkweed is a food source for the larval stage of monarch butterflies."
  },
  "Baptisia": {
    "image": "/plantImgs/baptisia.jpg",
    "description": "Baptisia, commonly referred to as wild indigo or false indigo, represents a diverse genus within the legume family, Fabaceae. These flowering herbaceous perennials exhibit an array of characteristics, including pea-like flowers, blooming in the spring that eventually mature into pods, occasionally displaying an inflated form. Renowned for their enduring presence and a spectrum of colours ranging from yellow, blue and white,[2] Baptisia's captivate gardeners with their colourful stems, unique foliage, and exquisite flowers.\n\nNative to regions spanning from the East to the Midwest of North America, Baptisia species contribute to the natural beauty of various ecosystems. Their flowers, adorned with characteristic wing and keel petals, give rise to bean-like fruit. Typically, their leaves are trifoliate, divided into three segments, often accompanied by small stipules on the petiole, which aid in species identification.[3]"
  },
  "Betula": {
    "image": "/plantImgs/betula.jpg",
    "description": "A birch is a thin-leaved deciduous hardwood tree of the genus Betula (/ˈbɛtjʊlə/),[2] in the family Betulaceae, which also includes alders, hazels, and hornbeams. It is closely related to the beech-oak family Fagaceae. The genus Betula contains 30 to 60 known taxa of which 11 are on the IUCN 2011 Red List of Threatened Species. They are typically short-lived pioneer species and are widespread in the Northern Hemisphere, particularly in northern areas of temperate climates and in boreal climates.[3] Birch wood is used for a wide range of purposes"
  },
  "Blephilia": {
    "image": "/plantImgs/blephilia.jpg",
    "description": "Blephilia, the pagoda plant or wood mint, is a genus of four species of flowering plants in the family Lamiaceae. They are all herbaceous plants native to eastern North America.[1][2] Blephilia are most often found in open areas, glades, and mesic forests. All species of Blephilia are considered threatened or endangered in some states. [3] [4][5] [6]\n\nThe genus includes only perennial species that spread by both seeds and through stem division. Small white to purple-lavender flowers occur in inflorescences that cluster in the upper leaf axils, often in several circular layers (hence the common name pagoda-plant). Leaves are generally lanceolate to ovate and vary in shades of green. Leaves are either petiolate or subsessile (depending on the species).[5] Like many other members of the subtribe Menthinae, all parts of Blephilia are highly aromatic when crushed and have smells similar to menthol and spearmint."
  },
  "Bothriochloa": {
    "image": "/plantImgs/bothriochloa.jpg",
    "description": "Bothriochloa is a common and widespread genus of plants in the grass family native to many countries on all inhabited continents and many islands.[4] They are often called beardgrass, bluegrass or bluestem. Some species are invasive in areas where they have been introduced.[5][6]\n\nThe etymology of the genus name Bothriochloa derives from the two ancient Greek words βοθρίον (bothríon), meaning \"small pit or trench\", and χλόη or χλόα (khlóa), meaning \"new green shoot or blade of grass\".[7][8][9"
  },
  "Bouteloua": {
    "image": "/plantImgs/bouteloua.jpg",
    "description": "Bouteloua is a genus of plants in the grass family Poaceae.[4][5] Members of the genus are commonly known as grama grass. The top of a flower spike of Bouteloua hirsuta ([hairy grama), showing the flattened rachis\nBouteloua includes both annual and perennial grasses, which frequently form stolons.[7] Species have an inflorescence of 1 to 80 racemes or spikes positioned alternately on the culm (stem). The rachis (stem) of the spike is flattened. The spikelets are positioned along one side of the spike. Each spikelet contains one fertile floret, and usually one sterile floret."
  },
  "Bulbostylis": {
    "image": "/plantImgs/bulbostylis.jpg",
    "description": "Bulbostylis is a genus of plants in the sedge family. They are sometimes called hairsedges. There are over 200 species of these clump-forming plants of dry grasslands and warm and tropical savannas worldwide. They have solid, rounded, grooved stems and long, thin basal leaves. They bear spikelets of flowers."
  },
  "Caltha": {
    "image": "/plantImgs/caltha.jpg",
    "description": "Caltha is a genus of rhizomatous perennial flowering plants in the family Ranunculaceae (\"buttercup family\"), to which ten species have been assigned. They occur in moist environments in temperate and cold regions of both the Northern and Southern Hemispheres.[3] Their leaves are generally heart-shaped or kidney-shaped, or are characteristically diplophyllous (the auricles of the leaf blades form distinctly inflexed appendages). Flowers are star shaped and mostly yellow to white. True petals and nectaries are missing but the five or more sepals are distinctly colored. As usual in the buttercup family there is a circle of stamens around (two to twenty-five) free carpels.[2]"
  },
  "Callitriche": {
    "image": "/plantImgs/callitriche.jpg",
    "description": "Callitriche is a genus of largely aquatic plants known as water-starwort. Previously, it was the only genus in the family Callitrichaceae. However, according to the APG II system this family is now included in the Plantaginaceae (plantain family). The family name Callitrichaceae retains its status as nomen conservandum (name to be retained)."
  },
  "Camassia": {
    "image": "/plantImgs/camassia.jpg",
    "description": "Camassia is a genus of plants in the asparagus family native to North America. Common names include camas, quamash, Indian hyacinth, camash, and wild hyacinth.[citation needed]\n\nIt grows in the wild in great numbers in moist meadows. They are perennial plants with basal linear leaves measuring 20 to 80 centimetres (8 to 32 in) in length, which emerge early in the spring. They grow to a height of 30 to 130 cm (12 to 50 in), with a multi-flowered stem rising above the main plant in summer. The six-petaled flowers vary in color from pale lilac or white to deep purple or blue-violet. Camas can appear to color entire meadows when in flower."
  },
  "Carex": {
    "image": "/plantImgs/carex.jpg",
    "ur;": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderProfileResults.aspx?gen=Carex",
    "description": "Carex is a vast genus of over 2,000 species of grass-like plants in the family Cyperaceae, commonly known as sedges (or seg, in older books). Other members of the family Cyperaceae are also called sedges, however those of genus Carex may be called true sedges, and it is the most species-rich genus in the family."
  },
  "Carya": {
    "image": "/plantImgs/carya.jpg",
    "description": "Hickory is a common name for trees composing the genus Carya, which includes 19 species accepted by Plants of the World Online.[3]\n\nSeven species are native to southeast Asia in China, Indochina, and northeastern India (Assam), and twelve are native to North America. A number of hickory species are used for their edible nuts or for their wood."
  },
  "Castilleja": {
    "image": "/plantImgs/castilleja.jpg",
    "description": "Castilleja, commonly known as paintbrush, Indian paintbrush, or prairie-fire, is a genus of about 200 species of annual and perennial mostly herbaceous plants native to the west of the Americas from Alaska south to the Andes, northern Asia, and one species as far west as the Kola Peninsula in northwestern Russia. These plants are classified in the broomrape family Orobanchaceae (following major rearrangements of the order Lamiales starting around 2001; sources which do not follow these reclassifications may place them in the Scrophulariaceae). They are hemiparasitic on the roots of grasses and forbs. The genus was named after Spanish botanist Domingo Castillejo."
  },
  "Cephalanthus": {
    "image": "/plantImgs/cephalanthus.jpg",
    "description": "Cephalanthus is a genus of flowering plants in the family Rubiaceae. There are five extant species[1] that are commonly known as buttonbush. They are shrubs or small trees growing to 5–15 m (16–49 ft) tall. The leaves are simple, arranged in opposite pairs or whorls of three. The flowers form a dense globular inflorescence.[citation needed]"
  },
  "Chaetopappa": {
    "image": "/plantImgs/chaetopappa.jpg",
    "description": "Chaetopappa is a genus of plants in the family Asteraceae which are known generally as leastdaisies.[2][3]\n\nThese wildflowers are native to western and central North America. The flower heads bear daisies with curled ray florets which may be white to shades of blue and purple, surrounding yellow disc florets."
  },
  "Chrysopsis": {
    "image": "/plantImgs/chrysopsis.jpg",
    "description": "Chrysopsis (golden asters) are plants in the family Asteraceae native to the southern and eastern United States. All the species are found in Florida, although some are found in other states as well.[2][3][4]\n\nThese are annual and perennial herbs bearing daisy-like flower heads with yellow disc florets and usually yellow ray florets. Some species formerly classified in this genus are now included in other genera: Heterotheca, Pityopsis, Stenotus, Ionactis, Aster, Eucephalus, Erigeron, Machaeranthera, Croptilon, Xanthisma, Oclemena, Bradburia, Oxypappus, Arnica, and Helichrysopsis.[1]\n\nGolden asters are often used as food plants by the larvae of some Lepidoptera species, including Schinia petulans (which feeds exclusively on C. subulata)."
  },
  "Cichorium": {
    "image": "/plantImgs/cichorium.jpg",
    "description": "Common chicory (Cichorium intybus) is a bushy perennial herb with blue or lavender (or, rarely, white or pink) flowers. It grows as a wild plant on roadsides in its native Europe, and in North America, where it has become naturalized. It is grown for its leaves, when it is known as leaf chicory, endive, radicchio, Belgian endive, French endive, or witloof. Other varieties are grown for their roots, which are used as a coffee substitute, similar to dandelion coffee.\n\nTrue endive (Cichorium endivia) is a species grown and used as a salad green. It has a slightly bitter taste. Curly endive and the broad-leafed escarole are true endives."
  },
  "Clematis": {
    "image": "/plantImgs/clematis.jpg",
    "description": ".Some species are shrubby, while others, like C. recta, are herbaceous perennial plants. The cool temperate species are deciduous, but many of the warmer climate species are evergreen. They grow best in cool, moist, well-drained soil in full sun.[10]\n\nClematis species are mainly found throughout the temperate regions of the Northern Hemisphere, rarely in the tropics. Clematis leaves are food for the caterpillars of some Lepidoptera species, including the willow beauty (Peribatodes rhomboidaria).\n\nThe timing and location of flowers varies; spring-blooming clematis flower on side shoots of the previous year's stems, summer/fall blooming clematis bloom only on the ends of new stems, and twice-flowering clematis do both.[5]"
  },
  "Cleome": {
    "image": "/plantImgs/cleome.jpg",
    "description": "Cleome is a genus of flowering plants in the family Cleomaceae, commonly known as spider flowers, spider plants, spider weeds, or bee plants.[2][3] Previously, it had been placed in the family Capparaceae, until DNA studies found the Cleomaceae genera to be more closely related to the Brassicaceae than the Capparaceae. Cleome and clammyweed (Polanisia dodecandra) can sometimes be confused.\n\nThe genus sensu stricto includes about 170 species of herbaceous annual or perennial plants and shrubs.[4] The genus has a subcosmopolitan distribution throughout the tropical and warm temperate regions of the world.[4] However, a recent DNA study failed to separate Cleome, Podandrogyne, and Polanisia from each other, so some taxonomists have abandoned the last two of these genera, treating them as part of Cleome sensu lato; in this case, Cleome contains about 275 species, the vast majority of the Cleomaceae."
  },
  "Conoclinium": {
    "image": "/plantImgs/conoclinium.jpg",
    "description": "Conoclinium, the mistflowers, is a genus of four[1] species of herbaceous perennial flowering plants, native to North America. They are 0.5 to 2 metres (1.6 to 6.6 ft) tall, and have blue to purple or violet flowers (occasionally white).\n\nThe plants of this genus have sometimes been classified in the genus Eupatorium, but late 20th century research shows they are more closely related to other plants of the Eupatorieae, such as Ageratum.[2]"
  },
  "Cornus": {
    "image": "/plantImgs/cornus.jpg",
    "description": "Cornus is a genus of about 30–60 species[Note 1] of woody plants in the family Cornaceae, commonly known as dogwoods or cornels, which can generally be distinguished by their blossoms, berries, and distinctive bark.[3] Most are deciduous trees or shrubs, but a few species are nearly herbaceous perennial subshrubs, and some species are evergreen. Several species have small heads of inconspicuous flowers surrounded by an involucre of large, typically white petal-like bracts, while others have more open clusters of petal-bearing flowers. The various species of dogwood are native throughout much of temperate and boreal Eurasia and North America, with China, Japan, and the southeastern United States being particularly rich in native species.\n\nSpecies include the common dogwood Cornus sanguinea of Eurasia, the widely cultivated flowering dogwood (Cornus florida) of eastern North America, the Pacific dogwood Cornus nuttallii of western North America, the Kousa dogwood Cornus kousa of eastern Asia, and two low-growing boreal species, the Canadian and Eurasian dwarf cornels (or bunchberries), Cornus canadensis and Cornus suecica respectively."
  },
  "Coreopsis": {
    "image": "/plantImgs/coreopsis.jpg",
    "description": "These plants range from 46–120 centimetres (18–47 inches) in height. The flowers are usually yellow with a toothed tip, but can also be yellow-and-red bicolor or pink.[3] They have showy flower heads with involucral bracts in two distinct series of eight each, the outer being commonly connate at the base. The flat fruits are small and dry and look like insects.\n\nThere are nearly 40 species of Coreopsis, all of which are native to North, Central, and South America.[1] The name Coreopsis is derived from the Ancient Greek words κόρις (transl. grc – transl. koris), meaning \"bedbug\", and ὄψις (transl. grc – transl. opsis), meaning \"view\", referring to the shape of the achene.[4][5]"
  },
  "Cynanchum": {
    "image": "/plantImgs/cynanchum.jpg",
    "description": "Cynanchum is a genus of about 300 species including some swallowworts, belonging to the family Apocynaceae. However, Cynanchum laeve is a vining perennial herb native to eastern and central U.S. states and Ontario. Common names include sand vine, honeyvine, honeyvine milkweed, bluevine milkweed, climbing milkweed, and smooth swallow-wort.[2] The root system of C. laeve can cause it to be very difficult to eradicate, especially in agricultural fields.[3] It is a larval food of monarch butterflies[4] and milkweed tussock moth larvae.[5] C. laeve can cause eye irritation if touched and can be toxic to humans and livestock if consumed in large quantities.[6]"
  },
  "Cyperus": {
    "image": "/plantImgs/cyperus.jpg",
    "description": "Cyperus is a large genus of about 700 species of sedges, distributed throughout all continents in both tropical and temperate regions.[2][3]\n\nDescription\nThey are annual or perennial plants, mostly aquatic and growing in still or slow-moving water up to 0.5 metres (20 in) deep. The species vary greatly in size, with small species only 5 centimetres (2 in) tall, while others can reach 5 metres (16 ft) in height. Common names include papyrus sedges, flatsedges, nutsedges, umbrella-sedges, galingales, and zozoro (from Malagasy). The stems are circular in cross-section in some, triangular in others, usually leafless for most of their length, with the slender grass-like leaves at the base of the plant, and in a whorl at the apex of the flowering stems. The flowers are greenish and wind-pollinated; they are produced in clusters among the apical leaves. The seed is a small nutlet.[4][5][6]"
  },
  "Cyclachaena": {
    "image": "/plantImgs/cyclachaena.jpg",
    "description": "Cyclachaena xanthiifolia (syn. Iva xanthiifolia), known as giant sumpweed, or rag sumpweed is a North American plant species in the sunflower family, Asteraceae. It is the only species in the genus Cyclachaena.[5] Giant sumpweed is believed to be native to the Great Plains but is now found across much of southern Canada and the contiguous United States, though rarely in the Southeast.[6][7]\n\nIt is an annual herb roughly 45–185 centimetres (18–72 inches) tall with stout, erect, branched stems. The stems are erect or ascending, finely ridged or grooved, and grayish-green. They are usually unbranched but sometimes have straight, upright branches. They are hairless near the base and are sparsely to moderately covered with fine curved or curled hairs above the base.[4]\n\nIn Britain and Ireland, it is known as marsh-elder.[8] It has been introduced and semi-naturalized in central and southern Britain, partly via seeds bought for bird food.[9]"
  },
  "Dalea": {
    "image": "/plantImgs/dalea.jpg",
    "description": "Dalea is a genus of flowering plants in the legume family, Fabaceae. Members of the genus are commonly known as prairie clover[2] or indigo bush.[3] Its name honors English apothecary Samuel Dale (1659–1739).[4] They are native to the Western hemisphere, where they are distributed from Canada to Argentina.[5] Nearly half of the known species are endemic to Mexico.[6] Two species of Dalea (Dalea ornata and Dalea searlsiae) have been considered for rangeland restoration.[7]"
  },
  "Dracopis": {
    "image": "/plantImgs/dracopis.jpg",
    "description": "Dracopis is a monotypic genus with Dracopis amplexicaulis (clasping coneflower; syn. Rudbeckia amplexicaulis) the sole species. It is native to North America.\n\nIt is an annual plant growing to 1 m tall, with simple or branched stems. The leaves are oval, 5–10 cm (2.0–3.9 in) long and 2–4 cm (0.79–1.57 in) broad. The flowers are produced in daisy-like inflorescences, with yellow to yellowish-purple florets. It is distinguished from the genus Rudbeckia (in which it used to be treated) by the presence of chaff subtending the ray flowers.\n\nIt is one of at least four genera in the flowering plant family Asteraceae whose members are commonly known as coneflowers; the others being Echinacea, Rudbeckia and Ratibida."
  },
  "Dysphania": {
    "image": "/plantImgs/dysphania.jpg",
    "description": "The species of genus Dysphania are annual plants or short-lived perennials. They are covered with stalked or sessile glandular hairs and therefore with aromatic scent (or malodorous to some people). Some species have uniseriate multicellular trichomes, rarely becoming glabrous. The stems are erect, ascending, decumbent, or prostrate and mostly branched.\n\nThe alternate leaves are mostly petiolate, (the upper ones sometimes sessile). The leaf blade is linear, lanceolate, oblanceolate, ovate, or elliptic, often pinnately lobed, with cuneate or truncate base, entire, dentate, or serrate margins."
  },
  "Dyssodia": {
    "image": "/plantImgs/dyssodia.jpg",
    "description": "Dyssodia is a small genus of flowering plants in the family Asteraceae. Many species formerly included in Dyssodia are now treated as members of other related genera, including Thymophylla or Adenophyllum. Dyssodia papposa is usually retained in this genus. The name is derived from the Greek δυσοδια (dusodia), meaning \"ill-smelling\".[2]\n\nSeveral species of Dyssodia (sensu lato) have found their way into the nursery trade and are relatively popular flowering annuals for hot, dry sites. Generally sold as threadleaf dyssodia (Dyssodia tenuisecta) and golden dyssodia (Dyssodia cf. pentachaeta). They perform best in well-drained soil."
  },
  "Echinacea": {
    "image": "/plantImgs/echinacea.jpg",
    "description": "Echinacea is a genus of herbaceous flowering plants in the daisy family. It has ten species, which are commonly called coneflowers. They are native only in eastern and central North America, where they grow in wet to dry prairies and open wooded areas. They have large, showy heads of composite flowers, blooming in summer. The generic name is derived from the Greek word ἐχῖνος (ekhinos), meaning \"hedgehog\", due to the spiny central disk. These flowering plants and their parts have different uses. Some species are cultivated in gardens for their showy flowers. Two of the species, E. tennesseensis and E. laevigata, were formerly listed in the United States as endangered species; E. tennesseensis has been delisted due to recovery[2] and E. laevigata is now listed as threatened."
  },
  "Eleocharis": {
    "image": "/plantImgs/eleocharis.jpg",
    "description": "Eleocharis is a virtually cosmopolitan genus of 250 or more species of flowering plants in the sedge family, Cyperaceae.[2] The name is derived from the Greek words ἕλειος (heleios), meaning \"marsh dweller,\" and χάρις (charis), meaning \"grace.\"[3] Members of the genus are known commonly as spikerushes or spikesedges. The genus has a geographically cosmopolitan distribution, with centers of diversity in the Amazon Rainforest and adjacent eastern slopes of the South American Andes, northern Australia, eastern North America, California, Southern Africa, and subtropical Asia. The vast majority of Eleocharis species grow in aquatic or mesic habitats from sea level to higher than 5,000 meters in elevation (in the tropical Andes).["
  },
  "Erigeron": {
    "image": "/plantImgs/erigeron.jpg",
    "description": "Erigeron (/ɪˈrɪdʒərɒn/)[4] is a large genus of plants in the composite family (Asteraceae).[5] It is placed in the tribe Astereae and is closely related to the Old World asters (Aster) and the true daisies (Bellis). The genus has a cosmopolitan distribution, and the highest diversity occurs in North America.[5][6][7][8][9]"
  },
  "Eriochloa": {
    "image": "/plantImgs/eriochloa.jpg",
    "description": "Eriochloa is a widespread genus of plants[4][5] in the grass family, commonly called cupgrass.[citation needed] They are found across much of Africa, Asia, Australia, and the Americas, plus a few places in European Russia."
  },
  "Eryngium": {
    "image": "/plantImgs/eryngium.jpg",
    "description": "Eryngium is a genus of flowering plants in the family Apiaceae. There are about 250 species.[1] The genus has a cosmopolitan distribution, with centres of diversity in the western Mediterranean, South America and Mexico.[2] Common names include eryngo and sea holly (though not to be confused with true hollies, of the genus Ilex).\n\nThese are annual and perennial herbs with hairless and usually spiny leaves. The dome-shaped umbels of steely blue or white flowers have whorls of spiny basal bracts. European and Asian species tend to be native to dry, rocky and coastal areas, and the American species are native to often damp grasslands.[3]"
  },
  "Eurybia": {
    "image": "/plantImgs/eurybia.jpg",
    "description": "Eurybia is a genus of plants in the family Asteraceae that were previously included in the genus Aster. Most species are native to North America, although one is also present in northern Eurasia. There are 23 species in the genus, including 1 natural hybrid. The name was first applied by Alexandre de Cassini in 1820. The name is derived from Ancient Greek εὐρύς (eurús), meaning \"wide\", and βαιός (baiós), meaning \"few\", perhaps in reference to the small number of relatively wide ray florets."
  },
  "Eustoma": {
    "image": "/plantImgs/eustoma.jpg",
    "description": "Eustoma, commonly known as lisianthus or prairie gentian,[1] is a small genus of plants in the gentian family. They are native to warm regions of the southern United States, Mexico, Caribbean and northern South America.[2] This genus is typically found in grasslands and in areas of disturbed ground."
  },
  "Forestiera": {
    "image": "/plantImgs/forestiera.jpg",
    "description": "The genus Forestiera is in the olive family; other members of the olive family that you might be familiar with are the ashes, lilacs, forsythia, “true” privets (Ligustrum spp.), and, of course, true olive."
  },
  "Fuirena": {
    "image": "/plantImgs/fuirena.jpg",
    "description": ""
  },
  "Gaillardia": {
    "image": "/plantImgs/gaillardia.jpg",
    "description": ""
  },
  "Gymnocarpium": {
    "image": "/plantImgs/gymnocarpium.jpg",
    "description": ""
  },
  "Heuchera": {
    "image": "/plantImgs/heuchera.jpg",
    "description": ""
  },
  "Helianthus": {
    "image": "/plantImgs/helianthus.jpg",
    "description": ""
  },
  "Helenium": {
    "image": "/plantImgs/helenium.jpg",
    "description": ""
  },
  "Hibiscus": {
    "image": "/plantImgs/hibiscus.jpg",
    "description": ""
  },
  "Hydrocotyle": {
    "image": "/plantImgs/hydrocotyle.jpg",
    "description": ""
  },
  "Ionactis": {
    "image": "/plantImgs/abronia.jpg",
    "description": ""
  },
  "Iris": {
    "image": "/plantImgs/iris.jpg",
    "description": ""
  },
  "Iva": {
    "image": "/plantImgs/iva.jpg",
    "description": ""
  },
  "Juncus": {
    "image": "/plantImgs/juncus.jpg",
    "description": ""
  },
  "Juniperus": {
    "image": "/plantImgs/juniperus.jpg",
    "description": ""
  },
  "Koeleria": {
    "image": "/plantImgs/koeleria.jpg",
    "description": ""
  },
  "Kyllinga": {
    "image": "/plantImgs/kyllinga.jpg",
    "description": ""
  },
  "Lactuca": {
    "image": "/plantImgs/lactuca.jpg",
    "description": ""
  },
  "Linum": {
    "image": "/plantImgs/linum.jpg",
    "description": ""
  },
  "Lotus": {
    "image": "/plantImgs/lotus.jpg",
    "description": ""
  },
  "Ludwigia": {
    "image": "/plantImgs/ludwigia.jpg",
    "description": ""
  },
  "Luzula": {
    "image": "/plantImgs/luzula.jpg",
    "description": ""
  },
  "Lygodesmia": {
    "image": "/plantImgs/lygodesmia.jpg",
    "description": ""
  },
  "Machaeranthera": {
    "image": "/plantImgs/abronia.jpg",
    "description": ""
  },
  "Malus": {
    "image": "/plantImgs/malus.jpg",
    "description": ""
  },
  "Mentha": {
    "image": "/plantImgs/abronia.jpg",
    "description": ""
  },
  "Mirabilis": {
    "image": "/plantImgs/mirabilis.jpg",
    "description": ""
  },
  "Monarda": {
    "image": "/plantImgs/monarda.jpg",
    "description": ""
  },
  "Nemastylis": {
    "image": "/plantImgs/nemastylis.jpg",
    "description": ""
  },
  "Nothocalais": {
    "image": "/plantImgs/nothocalais.jpg",
    "description": ""
  },
  "Opuntia": {
    "image": "/plantImgs/opuntia.jpg",
    "description": ""
  },
  "Packera": {
    "image": "/plantImgs/packera.jpg",
    "description": ""
  },
  "Panicum": {
    "image": "/plantImgs/panicum.jpg",
    "description": ""
  },
  "Penstemon": {
    "image": "/plantImgs/penstemon.jpg",
    "description": ""
  },
  "Penthorum": {
    "image": "/plantImgs/penthorum.jpg",
    "description": ""
  },
  "Phlox": {
    "image": "/plantImgs/phlox.jpg",
    "description": ""
  },
  "Phoradendron": {
    "image": "/plantImgs/phoradendron.jpg",
    "description": ""
  },
  "Phemeranthus": {
    "image": "/plantImgs/phemeranthus.jpg",
    "description": ""
  },
  "Physalis": {
    "image": "/plantImgs/physalis.jpg",
    "description": ""
  },
  "Platanthera": {
    "image": "/plantImgs/platanthera.jpg",
    "description": ""
  },
  "Platanus": {
    "image": "/plantImgs/platanus.jpg",
    "description": ""
  },
  "Polytaenia": {
    "image": "/plantImgs/polytaenia.jpg",
    "description": ""
  },
  "Pontederia": {
    "image": "/plantImgs/pontederia.jpg",
    "description": ""
  },
  "Quercus": {
    "image": "/plantImgs/quercus.jpg",
    "description": ""
  },
  "Ranunculus": {
    "image": "/plantImgs/ranunculus.jpg",
    "description": ""
  },
  "Ratibida": {
    "image": "/plantImgs/abronia.jpg",
    "description": ""
  },
  "Rayjacksonia": {
    "image": "/plantImgs/abronia.jpg",
    "description": ""
  },
  "Rhynchospora": {
    "image": "/plantImgs/rhynchospora.jpg",
    "description": ""
  },
  "Rosa": {
    "image": "/plantImgs/rosa.jpg",
    "description": ""
  },
  "Rudbeckia": {
    "image": "/plantImgs/rudbeckia.jpg",
    "description": ""
  },
  "Rumex": {
    "image": "/plantImgs/rumex.jpg",
    "description": ""
  },
  "Salix": {
    "image": "/plantImgs/salix.jpg",
    "description": ""
  },
  "Salvia": {
    "image": "/plantImgs/salvia.jpg",
    "description": ""
  },
  "Schizachyrium": {
    "image": "/plantImgs/schizachyrium.jpg",
    "description": ""
  },
  "Scleria": {
    "image": "/plantImgs/scleria.jpg",
    "description": ""
  },
  "Scutellaria": {
    "image": "/plantImgs/scutellaria.jpg",
    "description": ""
  },
  "Sedum": {
    "image": "/plantImgs/sedum.jpg",
    "description": ""
  },
  "Senecio": {
    "image": "/plantImgs/senecio.jpg",
    "description": ""
  },
  "Sida": {
    "image": "/plantImgs/sida.jpg",
    "description": ""
  },
  "Solidago": {
    "image": "/plantImgs/abronia.jpg",
    "description": ""
  },
  "Sonchus": {
    "image": "/plantImgs/sonchus.jpg",
    "description": ""
  },
  "Spartina": {
    "image": "/plantImgs/spartina.jpg",
    "description": ""
  },
  "Sphenopholis": {
    "image": "/plantImgs/sphenopholis.jpg",
    "description": ""
  },
  "Sporobolus": {
    "image": "/plantImgs/sporobolus.jpg",
    "description": ""
  },
  "Symphyotrichum novae-angliae": {
    "image": "/plantImgs/Symphyotrichum-novae-angliae.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=b540",
    "description": "Symphyotrichum novae-angliae, commonly called New England aster, is a Missouri native perennial which occurs in moist prairies, meadows, thickets, low valleys and stream banks (Steyermark) throughout the State. It is a stout, leafy plant typically growing 3-6' tall with a robust, upright habit. Features a profuse bloom of daisy-like asters (to 1.5\" diameter) with purple rays and yellow centers from late summer to early fall. Rough, hairy, lance-shaped leaves (to 4\" long) clasp stiff, hairy stems. Flowers are attractive to butterflies."
  },
  "Tilia": {
    "image": "/plantImgs/tilia.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=a917",
    "description": "Tilia americana, commonly called American basswood or American linden, is a medium to large deciduous tree which typically grows to 50-80’ (infrequently to over 100’) tall with an ovate-rounded crown. It is native to a variety of habitats from Quebec to the southeastern corner of Manitoba and far eastern North Dakota south to Oklahoma, Tennessee and North Carolina, with concentrations in forested areas of the Appalachian Mountains and along the Ohio River Valley to Missouri. Trees are found in both dry upland areas as well as moist, low woods. In Missouri, this tree typically occurs in rich woods, slopes, bluff bases and along streams throughout the State (Steyermark). This tree is noted for its (a) cymes of fragrant, pale yellow, late spring flowers, (b) small nutlets which follow the flowers and ripen by late summer, (c) mucilaginous sap, (d) noticeable winter buds, and (e) large ovate dark green leaves (to 6” long) with acuminate tips, serrate margins, often silvery undersides and uneven cordate bases. Flowers bloom in June in 5-10 flowered cymes. Each cyme droops from a showy, papery, narrow, leaf-like bract (to 5” long) where it is attached to the bract at a point somewhere between the base and midpoint. When a tree is in full bloom, bees often visit in such abundant numbers that humming can be heard many feet from the tree. Honey made from the nectar of these flowers is a prized gourmet item. Flowers have also been used to make tea. Syrup can be made from the sweet tree sap. Fall color is an undistinguished pale green to pale yellow. Winter twigs and buds are sometimes tinged with red."
  },
  "Tradescantia": {
    "image": "/plantImgs/tradescantia.jpg",
    "url": "https://en.wikipedia.org/wiki/Tradescantia",
    "description": "Tradescantia (/ˌtrædəˈskæntiə/[4]) is a genus of 85 species[5] of herbaceous perennial wildflowers in the family Commelinaceae, native to the Americas from southern Canada to northern Argentina, including the West Indies. Members of the genus are known by many common names, including inchplant, wandering jew, spiderwort,[6] dayflower and trad.[7][8]\n\nTradescantia grow 30–60 cm tall (1–2 ft), and are commonly found individually or in clumps in wooded areas and open fields. They were introduced into Europe as ornamental plants in the 17th century and are now grown in many parts of the world. Some species have become naturalized in regions of Europe, Asia, Africa, and Australia, and on some oceanic islands.[3]\n\nThe genus's many species are of interest to cytogenetics because of evolutionary changes in the structure and number of their chromosomes.[9] They have also been used as bioindicators for the detection of environmental mutagens.[10] Some species have become pests to cultivated crops and considered invasive."
  },
  "Vernonia": {
    "image": "/plantImgs/vernonia.jpg",
    "url:": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=277605",
    "description": "Vernonia arkansana, commonly called curlytop ironweed or Arkansas ironweed, is native from Illinois to Kansas south to Arkansas and Oklahoma. In Missouri, it typically occurs in gravel and sand bars along streams, slough margins, wet meadows, thickets, open woods, prairies and glades primarily in the Ozark region of the state (Steyermark). This plant is noted for its narrow, willow-like leaves, large flowering heads and narrow, twisting, involucral bracts. It is an upright perennial that typically grows on stiff, leafy, nearly glabrous stems which grow to 3-5’ tall in cultivation, but to as much as 6’ tall in the wild. Linear to linear-lanceolate leaves (to 7” long) are usually glabrous. Composite flowers, each with fluffy, pink-purple disks (rays absent), bloom in loose, corymbose cymes from late summer into fall. Flowers give way to rusty seed clusters. The source of the common name for vernonias has been varyingly attributed to certain “iron-like” plant qualities including tough stems, rusty-tinged fading flowers and rusty colored seeds. Notwithstanding its toughness, the plant is, with the exception of its attractive flowers, a somewhat unexceptional ornamental. Flowers are very attractive to butterflies. The within species is synonymous with and formerly known as V. crinita."
  },
  "Amsonia": {
    "image": "/plantImgs/amsonia.jpg",
    "url": "https://en.wikipedia.org/wiki/Amsonia",
    "description": "Amsonia is a genus of flowering plants in the dogbane family, Apocynaceae, first described as a genus in 1788. It is native primarily to North America with one species in East Asia and another in the eastern Mediterranean. It was named in honor of the American physician John Amson. Members of the genus are commonly known as bluestars."
  },
  "Arnoglossum": {
    "image": "/plantImgs/arnoglossum.jpg",
    "url": "https://en.wikipedia.org/wiki/Arnoglossum",
    "description": "Arnoglossum is a North American genus of plants in the family Asteraceae, described as a genus in 1817. They have the common name Indian plantain because they resemble the unrelated common plantain (Plantago spp.).\n\nArnoglossum is a member of the tribe Senecioneae which has been undergoing extensive revisions in recent years. Many of the species now in the genus were formerly classified in other genera such as Cacalia, Mesadenia, and Senecio. The remaining species are all native to North America (Ontario and eastern United States)."
  },
  "Aruncus":{
  "image": "/plantImgs/aruncus.jpg",
  "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=j430",
  "description": "Aruncus dioicus, commonly called goat's beard, is a Missouri native plant which occurs in moist woodlands and along bluffs in the central and southeast part of the State. A tall, erect, bushy, clump-forming plant typically growing 4-6' high which features pinnately compound, dark green foliage and showy, plume-like spikes of tiny, cream colored flowers which rise well above the foliage in early to mid summer, creating a bold effect. This rose family member is somewhat similar in appearance to astilbe. Dioecious (separate male and female plants) as the species name suggests. Plants with male flowers (numerous stamens per flower) produce a showier bloom than plants with female flowers (three pistils per flower)."
}

}



