{
  "Achillea millefolium": {
    "image": "/plantImgs/achillea-millefolium.jpg",
    "description": "Achillea millefolium, commonly called common yarrow, is a rhizomatous, spreading, upright to mat-forming perennial that is considered by many to be an aggressive weed. Common yarrow from Europe and Asia was originally introduced to America in colonial times, and has since naturalized throughout the U. S. primarily along roadsides, fields, waste areas and lawns. These species plants are noted for producing deeply-dissected, fern-like, aromatic, medium green foliage and tiny, long-lasting, white flowers that appear in dense, flattened, compound, corymb-like arrays (to 2-4” across) throughout the summer on stems typically rising 2-3’ tall. The flowers are attractive to butterflies and other insect pollinators. Foliage has a strong, somewhat spicy aroma that persists when used in dried arrangements. Species plants are uncommonly sold in commerce, however. It is the cultivars and hybrids of common yarrow, most of which have stronger stems, more upright habits and larger flowers, that have become popular flowering plants for ornamental gardens. Cultivars also extend the range of flower colors to include pinks, reds, creams, yellows and bicolor pastels.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=b282"
     },
  "Amsonia": {
    "image": "/plantImgs/amsonia.jpg",
    "url": "https://en.wikipedia.org/wiki/Amsonia",
    "description": "Amsonia is a genus of flowering plants in the dogbane family, Apocynaceae, first described as a genus in 1788. It is native primarily to North America with one species in East Asia and another in the eastern Mediterranean. It was named in honor of the American physician John Amson. Members of the genus are commonly known as bluestars."
  },
  "Arnoglossum": {
    "image": "/plantImgs/arnoglossum.jpg",
    "url": "https://en.wikipedia.org/wiki/Arnoglossum",
    "description": "Arnoglossum is a North American genus of plants in the family Asteraceae, described as a genus in 1817. They have the common name Indian plantain because they resemble the unrelated common plantain (Plantago spp.).\n\nArnoglossum is a member of the tribe Senecioneae which has been undergoing extensive revisions in recent years. Many of the species now in the genus were formerly classified in other genera such as Cacalia, Mesadenia, and Senecio. The remaining species are all native to North America (Ontario and eastern United States)."
  },
  "Aruncus dioicus":{
    "image": "/plantImgs/aruncus-dioicus.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=j430",
    "description": "Aruncus dioicus, commonly called goat's beard, is a Missouri native plant which occurs in moist woodlands and along bluffs in the central and southeast part of the State. A tall, erect, bushy, clump-forming plant typically growing 4-6' high which features pinnately compound, dark green foliage and showy, plume-like spikes of tiny, cream colored flowers which rise well above the foliage in early to mid summer, creating a bold effect. This rose family member is somewhat similar in appearance to astilbe. Dioecious (separate male and female plants) as the species name suggests. Plants with male flowers (numerous stamens per flower) produce a showier bloom than plants with female flowers (three pistils per flower)."
  },

  "Asclepias tuberosa": {
    "image": "/plantImgs/asclepias-tuberosa.jpg",
    "url":"https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=b490",
    "description": "Asclepias tuberosa, commonly called butterfly weed, is a tuberous rooted, Missouri native perennial which occurs in dry/rocky open woods, glades, prairies, fields and roadsides throughout the State (Steyermark). It typically grows in a clump to 1-2.5' tall and features clusters (umbels) of bright orange to yellow-orange flowers atop upright to reclining, hairy stems with narrow, lance-shaped leaves. Unlike many of the other milkweeds, this species does not have milky-sapped stems. Flowers give way to prominent, spindle-shaped seed pods (3-6\" long) which split open when ripe releasing numerous silky-tailed seeds for dispersal by the wind. Seed pods are valued in dried flower arrangements. Long bloom period from late spring throughout the summer. Flowers are a nectar source for hummingbirds, butterflies and many other pollinators, and leaves are a food source for monarch butterfly larvae (caterpillars)."
  },
  "Asclepias incarnata": {
    "image": "/plantImgs/asclepias-incarnata.jpg",
    "url":"https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=g410",
    "description": "Asclepias incarnata, commonly called swamp milkweed, is an erect, clump-forming, Missouri native plant which is commonly found in swamps, river bottomlands and wet meadows throughout the State. It typically grows 3-4' tall (less frequently to 5') on branching stems. Small, fragrant, pink to mauve flowers (1/4\" wide), each with five reflexed petals and an elevated central crown, appear in tight clusters (umbels) at the stem ends in summer. Flowers are uncommonly white. Narrow, lance-shaped, taper-pointed leaves are 3-6\" long. Stems exude a toxic milky sap when cut. Flowers are followed by attractive seed pods (to 4\" long) which split open when ripe releasing silky-haired seeds easily carried by the wind. Flowers are very attractive to butterflies and hummingbirds as a nectar source. In addition, swamp milkweed is a food source for the larval stage of monarch butterflies."
  },
  "Baptisia australis": {
    "image": "/plantImgs/baptisia-australis.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=b660",
    "description": "Baptisia australis, commonly called blue false indigo, is an upright perennial which typically grows 3-4' tall and occurs in rich woods, thickets and along streambanks from Pennsylvania south to North Carolina and Tennessee. It features purple, lupine-like flowers in erect racemes (to 12\") atop flower spikes extending well above a foliage mound of clover-like, trifoliate, bluish-green leaves (leaflets to 2\" long). Blooms in spring. Flowers give way to inflated seed pods (to 2.5\" long) which turn charcoal black when ripe and have considerable ornamental interest. Seeds rattle around in the blackened pods which were once popularly used by children as rattles. Stems with seed pods are valued additions to dried flower arrangements."
  },
  "Betula nigra": {
    "image": "/plantImgs/betula-nigra.jpg",
    "url": "https://www.missouribotanicalgarden.org/plantfinder/PlantFinderDetails.aspx?taxonid=277830",
    "description": "Betula nigra, commonly called river birch, is a vigorous, fast-growing, medium-sized, Missouri native deciduous tree which occurs on floodplains, swampy bottomlands and along streams throughout the State. In cultivation, it can be trained as either a single trunk or multi-trunked tree. As a single trunk tree, it develops a pyramidal habit when young, but matures to a more rounded shape typically growing 40-70' tall. Multi-trunked trees form a more irregular crown and are generally considered to be the superior growth habit for this species. Salmon-pink to reddish brown bark exfoliates to reveal lighter inner bark. Leathery, diamond-shaped, medium to dark green leaves (1.5-3.5\" long) with doubly toothed margins turn yellow in fall. Monoecious flowers appear in drooping, brownish male catkins and smaller, upright, greenish female catkins."
  },
  "Blephilia ciliata": {
    "image": "/plantImgs/blephilia-ciliata.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=281528",
    "description": "Blephilia ciliata, commonly called Ohio horsemint, is a Missouri native perennial which occurs in dryish open woods and thickets, clearings, fields and roadsides in the eastern 2/3 of the State. A clump-forming, mint family member that features mostly unbranched, square stems which rise to 30\" tall. Blue-purple, two-lipped flowers appear in late spring to mid-summer in several tiered, whorled, globular clusters in an interrupted terminal spike, with each cluster being subtended by (resting upon) a whorl of fringed bracts. Similar in appearance to the closely related monardas. Lanceolate stem leaves are sessile, lightly-toothed, whitish-downy below and mildly fragrant when crushed. Leaves are usually considered to be lacking in the pungency and quality needed for use as a culinary herb. Small basal leaves and shoots remain green throughout the winter.\n"
  },


  "Carex": {
    "image": "/plantImgs/carex.jpg",
    "ur;": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderProfileResults.aspx?gen=Carex",
    "description": "Carex is a vast genus of over 2,000 species of grass-like plants in the family Cyperaceae, commonly known as sedges (or seg, in older books). Other members of the family Cyperaceae are also called sedges, however those of genus Carex may be called true sedges, and it is the most species-rich genus in the family."
  },

  "Cephalanthus": {
    "image": "/plantImgs/cephalanthus.jpg",
    "description": "Cephalanthus is a genus of flowering plants in the family Rubiaceae. There are five extant species[1] that are commonly known as buttonbush. They are shrubs or small trees growing to 5–15 m (16–49 ft) tall. The leaves are simple, arranged in opposite pairs or whorls of three. The flowers form a dense globular inflorescence.[citation needed]"
  },

  "Clematis": {
    "image": "/plantImgs/clematis.jpg",
    "description": ".Some species are shrubby, while others, like C. recta, are herbaceous perennial plants. The cool temperate species are deciduous, but many of the warmer climate species are evergreen. They grow best in cool, moist, well-drained soil in full sun.[10]\n\nClematis species are mainly found throughout the temperate regions of the Northern Hemisphere, rarely in the tropics. Clematis leaves are food for the caterpillars of some Lepidoptera species, including the willow beauty (Peribatodes rhomboidaria).\n\nThe timing and location of flowers varies; spring-blooming clematis flower on side shoots of the previous year's stems, summer/fall blooming clematis bloom only on the ends of new stems, and twice-flowering clematis do both.[5]"
  },

  "Conoclinium": {
    "image": "/plantImgs/conoclinium.jpg",
    "description": "Conoclinium, the mistflowers, is a genus of four[1] species of herbaceous perennial flowering plants, native to North America. They are 0.5 to 2 metres (1.6 to 6.6 ft) tall, and have blue to purple or violet flowers (occasionally white).\n\nThe plants of this genus have sometimes been classified in the genus Eupatorium, but late 20th century research shows they are more closely related to other plants of the Eupatorieae, such as Ageratum.[2]"
  },
  "Cornus": {
    "image": "/plantImgs/cornus.jpg",
    "description": "Cornus is a genus of about 30–60 species[Note 1] of woody plants in the family Cornaceae, commonly known as dogwoods or cornels, which can generally be distinguished by their blossoms, berries, and distinctive bark.[3] Most are deciduous trees or shrubs, but a few species are nearly herbaceous perennial subshrubs, and some species are evergreen. Several species have small heads of inconspicuous flowers surrounded by an involucre of large, typically white petal-like bracts, while others have more open clusters of petal-bearing flowers. The various species of dogwood are native throughout much of temperate and boreal Eurasia and North America, with China, Japan, and the southeastern United States being particularly rich in native species.\n\nSpecies include the common dogwood Cornus sanguinea of Eurasia, the widely cultivated flowering dogwood (Cornus florida) of eastern North America, the Pacific dogwood Cornus nuttallii of western North America, the Kousa dogwood Cornus kousa of eastern Asia, and two low-growing boreal species, the Canadian and Eurasian dwarf cornels (or bunchberries), Cornus canadensis and Cornus suecica respectively."
  },
  "Coreopsis": {
    "image": "/plantImgs/coreopsis.jpg",
    "description": "These plants range from 46–120 centimetres (18–47 inches) in height. The flowers are usually yellow with a toothed tip, but can also be yellow-and-red bicolor or pink.[3] They have showy flower heads with involucral bracts in two distinct series of eight each, the outer being commonly connate at the base. The flat fruits are small and dry and look like insects.\n\nThere are nearly 40 species of Coreopsis, all of which are native to North, Central, and South America.[1] The name Coreopsis is derived from the Ancient Greek words κόρις (transl. grc – transl. koris), meaning \"bedbug\", and ὄψις (transl. grc – transl. opsis), meaning \"view\", referring to the shape of the achene.[4][5]"
  },

  "Echinacea": {
    "image": "/plantImgs/echinacea.jpg",
    "description": "Echinacea is a genus of herbaceous flowering plants in the daisy family. It has ten species, which are commonly called coneflowers. They are native only in eastern and central North America, where they grow in wet to dry prairies and open wooded areas. They have large, showy heads of composite flowers, blooming in summer. The generic name is derived from the Greek word ἐχῖνος (ekhinos), meaning \"hedgehog\", due to the spiny central disk. These flowering plants and their parts have different uses. Some species are cultivated in gardens for their showy flowers. Two of the species, E. tennesseensis and E. laevigata, were formerly listed in the United States as endangered species; E. tennesseensis has been delisted due to recovery[2] and E. laevigata is now listed as threatened."
  },

  "Heuchera": {
    "image": "/plantImgs/heuchera.jpg",
    "description": ""
  },

  "Helenium": {
    "image": "/plantImgs/helenium.jpg",
    "description": ""
  },
  "Hibiscus": {
    "image": "/plantImgs/hibiscus.jpg",
    "description": ""
  },

  "Iris": {
    "image": "/plantImgs/iris.jpg",
    "description": ""
  },

  "Juncus effusus": {
    "image": "/plantImgs/juncus-effusus.jpg",
    "description": "Juncus effuses, commonly known as soft rush, common rush, bog rush or mat rush, is a grasslike-like, rhizomatous, wetland perennial that features smooth, upright, cylindrical, unjointed, spire-like green stems (leaves are absent) which grow in spreading basal clumps to 20-40” tall. It is one of the true rushes. It has a nearly cosmopolitan distribution, being found in many places around the world, but primarily in cool-temperate regions, particularly ones having wet soils. It is often found growing in ditches, bogs, swamps, marshes, wet pastures, and along the margins of lakes and rivers. It is infrequently found growing in tropical areas. Stems are usually solid, with the leaves typically reduced to bladeless basal sheathes. Insignificant, minute, yellowish-green to pale brown flowers bloom in one-sided clusters (many-flowered cymes) located on stem sides slightly below the stem tips. Flowers emerge in summer (July to September). Fruit is an obovoid capsule. Clumps provide vertical accent to moist garden areas. Although the stems appear from a distance as coarse and stiff, they are soft to the touch. Soft rush is considered to be a somewhat invasive weed in a number of locations. Foliage turns yellow in fall before browning up for winter.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=c262"
  },
  "Juniperus virginiana": {
    "image": "/plantImgs/juniperus-virginiana.jpg",
    "description": "Juniperus virginiana, commonly called Eastern red cedar, is native to Missouri where it typically occurs on limestone bluffs and glades, wood margins, fields, pastures and fence rows throughout the state except for the southeastern lowlands (Steyermark). It is a broadly conical, sometimes columnar, dense, evergreen conifer with horizontal branching that typically grows to 30-65’ tall. Gray to reddish-brown bark exfoliates in thin shreddy strips on mature trees. Trunks are often fluted at the base. Heartwood is reddish-brown and aromatic, and is commonly used for cedar chests. Dark blue green scale-like foliage. Foliage may turn brown-green in winter. Cultivars of this species often retain better foliage color in winter. This is a dioecious species (separate male and female trees). Female trees produce round, gray to blackish-green berry-like cones (1/4” diameter) that ripen in fall the first year. Berry-like cones are attractive to many birds.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=279605"
  },

  "Ludwigia alternifolia": {
    "image": "/plantImgs/ludwigia-alternifolia.jpg",
    "description": "udwigia alternifolia, commonly called seedbox or rattlebox, is a multi-branched, yellow-flowered perennial of the evening primrose family. It typically grows to 2-3' (4') tall on reddish-tinged stems clad with short-stalked, sharply-pointed, lance-shaped, deep green leaves (to 4\" long). It is native primarily to marshes, wet meadows and swamps from southern Quebec and Ontario to Kansas and south to Texas and Florida. It is found throughout the State of Missouri on stream/pond margins, wet meadows, wet places in prairies and depressions, low wet woodlands, fallow fields, ditches and along railroad right-of-ways (Steyermark). Solitary, bright yellow flowers (each to 3/4\" wide) bloom on short stalks in the upper leaf axils from June to August. Flowers have four small yellow petals that are quickly shed (often dropping on the same day they open), leaving four, ovate, non-reflexed, green (sometimes red-tinged) sepals (same size as the petals). Flowers eventually give way to fruits (cubical capsules to 1/4\" long), each having an apical pore. Each capsule splits open when ripe to release the numerous seeds contained therein.\n",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=e113"
  },

  "Monarda": {
    "image": "/plantImgs/monarda.jpg",
    "description": "Monarda bradburiana (Eastern Beebalm) and Monarda fistulosa (Wild Bergamot) are both bee balm species, but they have key differences in their size, habit, and flowering times. Monarda bradburiana is shorter, clumping, and blooms earlier in the season compared to Monarda fistulosa, which is taller and spreads more by underground runners.",
    "url": "https://mdc.mo.gov/discover-nature/field-guide/wild-bergamot"
  },

  "Panicum virgatum": {
    "image": "/plantImgs/panicum-virgatum.jpg",
    "description": "Panicum virgatum, commonly called switch grass, is a Missouri native ornamental grass which was an important component of the tallgrass prairie which once covered large areas of the State. It occurs in both wet and dry soils in prairies and open woods, gravel bars and stream banks and along railroad tracks throughout most of the State. Switch grass is generally noted for its stiff, columnar form, and typically retains its vertical shape throughout the growing season. It is a clump-forming, warm season grass which typically grows to 3' tall. When in flower, flower panicles may bring total plant height to 6'. Features medium green leaves which turn yellow (sometimes with orange tints) in autumn, fading to tan-beige in winter. Foliage clump is topped in mid-summer by finely-textured, pink-tinged, branched flower panicles which hover over the foliage like an airy cloud. Panicles turn beige as the seeds mature in fall with the seed plumes persisting well into winter. Seeds are a food source for birds in winter.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=l460"
  },

  "Penstemon digitalis": {
    "image": "/plantImgs/penstemon-digitalis.jpg",
    "description": "Penstemon digitalis, commonly called foxglove beardtongue or tall white beardtongue, is a clump-forming, Missouri-native perennial which typically grows 3-5' tall and occurs in prairies, fields, wood margins, open woods and along railroad tracks. Features white, two-lipped, tubular flowers (to 1.25\" long) borne in panicles atop erect, rigid stems. Flowers bloom mid-spring to early summer and are attractive to hummingbirds, butterflies, and other pollinators. Basal leaves are elliptic and stem leaves are lance-shaped to oblong.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=g590"
  },
  "Phlox": {
    "image": "/plantImgs/phlox.jpg",
    "description": "Perennial phlox is a tall, late-blooming perennial phlox with big, showy, fragrant clusters of flowers. The flowers are in dense, pyramidal, terminal clusters in many shades of purple, red-purple, rose, and rarely white. Cultivated forms come in many different colors and color patterns. The individual flowers have the typical phlox shape, with a narrow tube that flares out with 5 flat petal lobes. Blooms July–October. Leaves opposite, sessile (stalkless), oblong to lance-shaped, prominently veined, and spaced apart on stems.",
    "url": "https://mdc.mo.gov/discover-nature/field-guide/perennial-phlox"
  },
  "Quercus": {
    "image": "/plantImgs/quercus.jpg",
    "description": "There are 22 species of oaks that grow native or are naturalized in Missouri. Also, more than 30 different oak hybrids (crosses between the various species) have been recorded in the state.\n\nThe oaks, which are related to beech, chestnut, and chinquapin, have several distinguishing characteristics. The fruit is the familiar acorn, a staple food for many species of wild animals. Leaves occur singly on alternate sides of the twig. Large pores are found in the springwood, and rays of wood radiate from the pith. Next to the acorn, the best identifying characteristic is the cluster or groups of buds found at the end of the twigs. The star-shaped pith of the twigs is characteristic also.",
    "url": "https://mdc.mo.gov/discover-nature/field-guide/oaks"
  },
  "Ratibida pinnata": {
    "image": "/plantImgs/ratibida-pinnata.jpg",
    "description": "atibida pinnata, commonly called gray headed coneflower, is a Missouri native plant which typically occurs in dry woods, prairies and along railroad tracks and roads. A somewhat rough-looking plant that features pinnately divided leaves (to 5\" long) on stiff stems growing 3-5' tall. The composite flowers have a dull-gray central disk in the shape of an elongated cylinder (1 inch long), somewhat resembling the crown of a slender sombrero. When bruised, the disk smells of anise. Attached to the bottom of the disk is a brim of 3-7, extremely reflexed (downward pointing), bright yellow ray flowers (to 3\" long). Long summer bloom period.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=l940"
  },
  "Rudbeckia": {
    "image": "/plantImgs/rudbeckia.jpg",
    "description": "Rudbeckia is a plant genus in the Asteraceae or composite family.[5][6] Rudbeckia flowers feature a prominent, raised central disc in black, brown shades of green, and in-between tones, giving rise to their familiar common names of coneflowers and black-eyed-susans. All are native to North America, and many species are cultivated in gardens for their showy yellow or gold flower heads that bloom in mid to late summer.",
    "url": "https://en.wikipedia.org/wiki/Rudbeckia"
  },
  "Salix humilis": {
    "image": "/plantImgs/salix-humilis.jpg",
    "url": "https://grownative.org/native_plants/prairie-willow/",
    "description": "Fuzzy flowers open March-May, before leaves emerge. The slowly spreading nature of this shrub results in a multi-stemmed plant that is wider than tall (usually around 4 ft). Unlike many other moisture-loving willows, this one prefers drier ground. Rabbits and deer eat twigs, leaves and shoots. Bees use the nectar to produce high quality honey. Dense thickets provide good wildlife cover. Host plant for larvae of the viceroy butterfly."
  },
  "Salvia azurea": {
    "image": "/plantImgs/salvia-azurea.jpg",
    "description": "Salvia azurea, commonly called blue sage, is a clump-forming perennial that typically grows to 3-5’ tall (shorter if pruned). Whorls of 2-lipped, azure blue flowers bloom in spikes from mid-summer to fall atop stiff stems clad with linear to lanceolate to obovate, grayish-green leaves (to 3-4” long). Salvia azurea var. azurea is native from North Carolina and Tennessee south to Florida and Texas. Salvia azurea var. grandiflora grows further west to New Mexico and further north to Nebraska and Minnesota. Although similar in appearance, var. grandiflora has larger flowers and is often considered to be a better garden plant than var. azurea.\n\nThe genus name Salvia comes from the Latin word salveo meaning \"to save or heal\", in reference to the purported medically curative properties attributed to some plants in the genus.\n",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=281504"
  },
  "Schizachyrium scoparium": {
    "image": "/plantImgs/schizachyrium-scoparium.jpg",
    "description": "Schizachyrium scoparium, commonly called little bluestem, is native to prairies, fields, clearings, hills, limestone glades, roadsides, waste areas and open woods from Alberta to Quebec south to Arizona and Florida. It was one of the dominant grasses of the vast tallgrass prairie region which once covered rich and fertile soils in many parts of central North America. It typically matures to 2-4’ (less frequently to 5’) tall, and features upright clumps of slender, flat, linear green leaves (to 1/4“ wide), with each leaf having a tinge of blue at the base. The foliage turns shades of bronze-orange in the fall. Purplish-bronze flowers appear in 3” long racemes on branched stems rising above the foliage in August. Flowers are followed by clusters of fluffy, silvery-white seed heads which are attractive and often persist into winter. The seeds are eaten by many species of birds.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=f510"
  },
  "Sedum ternatum": {
    "image": "/plantImgs/sedum-ternatum.jpg",
    "description": "edum ternatum, commonly called three-leaved stonecrop (also commonly called whorled stonecrop), is a small, spreading, Missouri native perennial which typically occurs in damp locations along stream banks, bluff bases and stony ledges (as in stonecrop). Grows 3-6\" high and spreads by creeping stems which root at the nodes. Stems break away and die in winter, leaving newly rooted plants separated from the mother plant. Features small, rounded, fleshy, succulent-like leaves (to 3/4\" long) which appear in whorls of three, thus giving rise to the common names. Clusters of tiny white, star-like flowers (to 1/2\" wide) with purplish stamens appear on erect stems above the foliage in spring.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=m310"
  },
  "Packera aurea": {
    "image": "/plantImgs/packera-aurea.jpg",
    "description": "Packera aurea, commonly called golden ragwort or golden groundsel, is a rhizomatous, spreading, herbaceous perennial native to moist woods, meadows, gravel bars, and stream banks in the eastern United States and southeastern Canada. Features flat-topped clusters (corymbs) of yellow, daisy-like flowers (to 1\" diameter) atop sparsely-leaved stems in early spring. The blooms are attractive to butterflies, bees, and other insect pollinators. Oblong stem leaves are finely cut (pinnately lobed) and quite distinctive. Flowering stems typically rise 1-2' tall from basal clumps of long-stemmed, heart-shaped, toothed, dark green leaves that often have a purplish tinge beneath. The foliage is one of the few larval food sources for the northern metalmark butterfly.",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=l350"
  },
  "Packera obovata": {
    "image": "/plantImgs/packera-obovata.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=292089&isprofile=1&basic=packera%20obovata",
    "description": "Packera obovata, commonly called roundleaf ragwort or roundleaf groundsel, is valued for its ability to thrive in shady locations, naturalize rapidly, and produce a long and profuse spring bloom of bright yellow flowers. It is native to rocky wooded hillsides, open rocky glades, limestone ledges, stream banks and moist meadows from Quebec and Ontario south to Texas and Florida. In Missouri it most often is found in the Ozark region in the southern and central part of the State (Steyermark). Flat-topped clusters (corymbs) of daisy-like flowers (3/4\" diameter) with yellow rays and yellow central disks bloom in spring (April-June) atop sparsely-leaved stems rising to 18\" tall. Flowering stems rise from a basal clump of serrate, rounded to spatulate leaves (to 2-4\" long) each of which tapers at the base into a long petiole. Upper stem leaves are much smaller, sessile and pinnately lobed. Synonymous with Senecio obovatus."
  },
  "Solidago": {
    "image": "/plantImgs/solidago.jpg",
    "url": "https://mdc.mo.gov/discover-nature/field-guide/goldenrods",
    "description": "Solidago, commonly called goldenrods, is a genus of about 100[1] to 120[2] species of flowering plants in the family Asteraceae. Most are herbaceous perennial species found in open areas such as meadows, prairies, and savannas. Many insects lay eggs on goldenrods — in fact, the plant is a miniature habitat for a surprisingly large number of species. Moth larvae and other insects grow inside the stems, frequently creating galls, enlarged portions of the stems that develop in response to the insect's presence. The galls of many gall-making insects are plundered by parasitic wasps, which lay their eggs on the larvae. Some woodpeckers also eat the larvae at the centers of the galls.\n\nIn late summer and early fall, watch the insect activity on a colony of goldenrods. Goldenrods, which typically bloom late in the growing season, are a critical nectar source for many insects, including bees, butterflies, wasps, beetles, flies, and more. For many, it is their last food source before freezing weather puts a stop to nearly all insect activity. Spiders, ambush and assassin bugs, and other predators lay in wait for these pollen- and nectar-feeders."
  },
  "Sporobolus heterolepis": {
    "image": "/plantImgs/sporobolus-heterolepis.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=f680",
    "description": "Sporobolus heterolepis, called prairie dropseed, is a clump-forming, warm season, perennial grass which typically occurs in prairies, glades, open ground and along railroads in parts of the central and western United States and southern Canada. Fine-textured, hair-like, medium green leaves (to 20” long and 1/16” wide) typically form an arching foliage mound to 15” tall and 18” wide. Foliage turns golden with orange hues in fall, fading to light bronze in winter. Open, branching flower panicles appear on slender stems which rise well above the foliage clump in late summer to 30-36\" tall. Flowers have pink and brown coloration but are perhaps most noted for their unique and noticeable (some may say pungent) scent that has variously been described as resembling a combination of coriander, popcorn, honey, sunflower seeds, and melted wax. Tiny rounded mature seeds drop to the ground from their hulls in autumn giving rise to the descriptive common name."
  },
  "Symphyotrichum novae-angliae": {
    "image": "/plantImgs/symphyotrichum_novae-angliae.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=b540",
    "description": "Symphyotrichum novae-angliae, commonly called New England aster, is a Missouri native perennial which occurs in moist prairies, meadows, thickets, low valleys and stream banks (Steyermark) throughout the State. It is a stout, leafy plant typically growing 3-6' tall with a robust, upright habit. Features a profuse bloom of daisy-like asters (to 1.5\" diameter) with purple rays and yellow centers from late summer to early fall. Rough, hairy, lance-shaped leaves (to 4\" long) clasp stiff, hairy stems. Flowers are attractive to butterflies."
  },
  "Tilia": {
    "image": "/plantImgs/tilia.jpg",
    "url": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?kempercode=a917",
    "description": "Tilia americana, commonly called American basswood or American linden, is a medium to large deciduous tree which typically grows to 50-80’ (infrequently to over 100’) tall with an ovate-rounded crown. It is native to a variety of habitats from Quebec to the southeastern corner of Manitoba and far eastern North Dakota south to Oklahoma, Tennessee and North Carolina, with concentrations in forested areas of the Appalachian Mountains and along the Ohio River Valley to Missouri. Trees are found in both dry upland areas as well as moist, low woods. In Missouri, this tree typically occurs in rich woods, slopes, bluff bases and along streams throughout the State (Steyermark). This tree is noted for its (a) cymes of fragrant, pale yellow, late spring flowers, (b) small nutlets which follow the flowers and ripen by late summer, (c) mucilaginous sap, (d) noticeable winter buds, and (e) large ovate dark green leaves (to 6” long) with acuminate tips, serrate margins, often silvery undersides and uneven cordate bases. Flowers bloom in June in 5-10 flowered cymes. Each cyme droops from a showy, papery, narrow, leaf-like bract (to 5” long) where it is attached to the bract at a point somewhere between the base and midpoint. When a tree is in full bloom, bees often visit in such abundant numbers that humming can be heard many feet from the tree. Honey made from the nectar of these flowers is a prized gourmet item. Flowers have also been used to make tea. Syrup can be made from the sweet tree sap. Fall color is an undistinguished pale green to pale yellow. Winter twigs and buds are sometimes tinged with red."
  },
  "Tradescantia": {
    "image": "/plantImgs/tradescantia.jpg",
    "url": "https://en.wikipedia.org/wiki/Tradescantia",
    "description": "Tradescantia (/ˌtrædəˈskæntiə/[4]) is a genus of 85 species[5] of herbaceous perennial wildflowers in the family Commelinaceae, native to the Americas from southern Canada to northern Argentina, including the West Indies. Members of the genus are known by many common names, including inchplant, wandering jew, spiderwort,[6] dayflower and trad.[7][8]\n\nTradescantia grow 30–60 cm tall (1–2 ft), and are commonly found individually or in clumps in wooded areas and open fields. They were introduced into Europe as ornamental plants in the 17th century and are now grown in many parts of the world. Some species have become naturalized in regions of Europe, Asia, Africa, and Australia, and on some oceanic islands.[3]\n\nThe genus's many species are of interest to cytogenetics because of evolutionary changes in the structure and number of their chromosomes.[9] They have also been used as bioindicators for the detection of environmental mutagens.[10] Some species have become pests to cultivated crops and considered invasive."
  },
  "Vernonia": {
    "image": "/plantImgs/vernonia.jpg",
    "url:": "https://www.missouribotanicalgarden.org/PlantFinder/PlantFinderDetails.aspx?taxonid=277605",
    "description": "Vernonia arkansana, commonly called curlytop ironweed or Arkansas ironweed, is native from Illinois to Kansas south to Arkansas and Oklahoma. In Missouri, it typically occurs in gravel and sand bars along streams, slough margins, wet meadows, thickets, open woods, prairies and glades primarily in the Ozark region of the state (Steyermark). This plant is noted for its narrow, willow-like leaves, large flowering heads and narrow, twisting, involucral bracts. It is an upright perennial that typically grows on stiff, leafy, nearly glabrous stems which grow to 3-5’ tall in cultivation, but to as much as 6’ tall in the wild. Linear to linear-lanceolate leaves (to 7” long) are usually glabrous. Composite flowers, each with fluffy, pink-purple disks (rays absent), bloom in loose, corymbose cymes from late summer into fall. Flowers give way to rusty seed clusters. The source of the common name for vernonias has been varyingly attributed to certain “iron-like” plant qualities including tough stems, rusty-tinged fading flowers and rusty colored seeds. Notwithstanding its toughness, the plant is, with the exception of its attractive flowers, a somewhat unexceptional ornamental. Flowers are very attractive to butterflies. The within species is synonymous with and formerly known as V. crinita."
  }
}



